# üìùAssignment-2:

## üéìTask 1:

In [25]:
import pandas as pd

In [26]:
df = pd.DataFrame({
    'Name':['Alice','Bob','Charlie','Diana','Eve'],
    'Age':[24,27,22,32,29],
    'Department':['HR','Finance','IT','Marketing','HR'],
    'Salary':[45000,54000,50000,62000,47000]
})
df.head(5)

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [27]:
df.to_csv("job.csv", index = False)

In [28]:
df['Age'].describe()

count     5.000000
mean     26.800000
std       3.962323
min      22.000000
25%      24.000000
50%      27.000000
75%      29.000000
max      32.000000
Name: Age, dtype: float64

In [29]:
df['Salary'].describe()

count        5.000000
mean     51600.000000
std       6730.527468
min      45000.000000
25%      47000.000000
50%      50000.000000
75%      54000.000000
max      62000.000000
Name: Salary, dtype: float64

In [42]:
HR_salary = df[df['Department'] == 'HR']['Salary'].mean()
print('HR Avg salary will be: ',HR_salary)

HR Avg salary will be:  46000.0

## üéìTask 2:

In [31]:
df['Bonus'] = df['Salary']*0.1
df['Bonus']
df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

## üéìTask 3:

In [33]:
filtered_df = df[df['Age'].between(25,30)]
print(filtered_df)

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

## üéìTask 4:

In [35]:
Group = df.groupby('Department')['Salary'].mean()
print(Group)

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

## üéìTask 5:

In [36]:
sorted_df = df.sort_values(by='Salary',ascending = True)
print(sorted_df)

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

In [38]:
sorted_df.to_csv("job1.csv", index = False)
print("Your Csv file is created!")

Your Csv file is created!

In [43]:
sorted_df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0